LEGACY: PROC OPTIONS(MAIN);
   DCL DATA_IN CHAR(100);
   
   /* SIMULATING SQL (2 Calls) */
   EXEC SQL SELECT COUNT(*) INTO :CNT FROM TABLE_A;
   EXEC SQL COMMIT;

   /* SIMULATING IO (2 Calls) */
   READ FILE(INPUT) INTO(DATA_IN);
   WRITE FILE(OUTPUT) FROM(DATA_IN);

   /* SIMULATING LOOPS (1 Loop) */
   DO I = 1 TO 100;
      PUT SKIP LIST('PROCESSING');
   END;

END LEGACY;